# Python modules
from typing import Any
from datetime import datetime

# Django
from django.core.management.base import BaseCommand

# Project modules
from dictionaries.models import (
    Department,
    Management,
    Degree
)


class Command(BaseCommand):
    """ Command for filling data up database """
    def __init__(
        self,
        *args: list,
        **kwargs: dict
    ) -> None:
        self.departmens: list = [
            {
                "ru": "ДП Карагандинской области",
                "kk": "Қарағанды облысының ПД",
            },
            {
                "ru": "Октябьрский ОП",
                "kk": "Октябрь ПБ",
            },
            {
                "ru": "Центральный ОП",
                "kk": "Орталық ПБ",
            },
            {
                "ru": "Кировский ОП",
                "kk": "Киров ПБ",
            },
            {
                "ru": "Михайловский ОП",
                "kk": "Михайлов ПБ",
            },
            {
                "ru": "Юго-Восточный ОП",
                "kk": "Оңтүстік-Шығыс ПБ",
            },
            {
                "ru": "Ново-Майкудукский ОП",
                "kk": "Жаңа-Майқұдық ПБ",
            },
            {
                "ru": "УП г.Караганды",
                "kk": "Қарағанды қ. ПБ",
            },
            {
                "ru": "Восточный ОП",
                "kk": "Шығыс ПБ",
            },
            {
                "ru": "Старогородской ОП",
                "kk": "Ескіқалалық ПБ",
            },
            {
                "ru": "УП г.Темиртау",
                "kk": "Теміртау қ. ПБ",
            },
            {
                "ru": "ОП г.Шахтинск",
                "kk": "Шахтинск қ. ПБ",
            },
            {
                "ru": "ОП г.Сарань",
                "kk": "Саран қ. ПБ",
            },
            {
                "ru": "ОП г.Балхаш",
                "kk": "Балқаш қ. ПБ",
            },
            {
                "ru": "ОП Абайского района",
                "kk": "Абай ауданының ПБ",
            },
            {
                "ru": "Топарский ОП",
                "kk": "Топар ПБ",
            },
            {
                "ru": "ОП Бухар-Жырауского района",
                "kk": "Бұқар-Жырау ауданынң ПБ",
            },
            {
                "ru": "ОП им.Мустафина",
                "kk": "Мұстафин а. ПБ",
            },
            {
                "ru": "ОП Нуринского района",
                "kk": "Нұра ауданының ПБ",
            },
            {
                "ru": "ОП Каркаралинского района",
                "kk": "Қарқаралы ауданының ПБ",
            },
            {
                "ru": "ОП Шетского района",
                "kk": "Шет ауданының ПБ",
            },
            {
                "ru": "ОП Актогайсокого района",
                "kk": "Ақтоғай ауданының ПБ",
            },
            {
                "ru": "ОП Осакаровского района",
                "kk": "Осакаров ауданының ПБ",
            },
        ]

        self.managements: list = [
            {
                "ru": "Подразделение специального назначения",
                "kk": "Арлан арнайы мақсаттағы бөлімше",
            },
            {
                "ru": "Управление по внутренним и внешним коммуникациям",
                "kk": "Ішкі және сыртқы коммуникациялар басқармасы",
            },
            {
                "ru": "Управление специализированной охранной службы",
                "kk": "Арнайы қызмет күзетінің басқармасы",
            },
            {
                "ru": "Управление информатизации и связи",
                "kk": "Ақпараттандыру және байланыс басқармасы",
            },
            {
                "ru": "Руководство",
                "kk": "Басшылық",
            },
            {
                "ru": "Второй спец. отдел",
                "kk": "Екінші арнайы бөлім",
            },
            {
                "ru": "Оперативно-криманилистическое управление",
                "kk": "Жедел криминалистік басқармасы",
            },
            {
                "ru": "Местная полицейская служба",
                "kk": "Жергілікті полиция қызметі",
            },
            {
                "ru": "Седьмое управление",
                "kk": "Жетінші басқарма",
            },
            {
                "ru": "Юридический отдел",
                "kk": "Заң бөлімі",
            },
            {
                "ru": "Управление кадровой политики",
                "kk": "Кадрлік саясат басқармасы",
            },
            {
                "ru": "Центр кинологической службы",
                "kk": "Кинологиялық қызмет орталығы",
            },
            {
                "ru": "Управление криминальной полиции",
                "kk": "Криминалдық полиция басқармасы",
            },
            {
                "ru": "Управление миграционной службы",
                "kk": "Көші қон полиция басқармасы",
            },
            {
                "ru": "Медицинский отдел",
                "kk": "Медициналық бөлім",
            },
            {
                "ru": "ОВВК",
                "kk": "Округтік әскери-дәрігерлік комиссиясы",
            },
            {
                "ru": "Десятое управление",
                "kk": "Оныншы басқарма",
            },
            {
                "ru": "ППП",
                "kk": "Патрульдік полиция полкі",
            },
            {
                "ru": "Следственное управление",
                "kk": "Тергеу басқармасы",
            },
            {
                "ru": "Управление тылового обеспечения",
                "kk": "Тылдық қамтамасыз ету басқармасы",
            },
            {
                "ru": "Секретариат",
                "kk": "Хатшылық",
            },
            {
                "ru": "Штаб управление",
                "kk": "Штаб басқармасы",
            },
            {
                "ru": "Управление по борьбе с экстремизмом",
                "kk": "Экстремизмге қарсы күрес жөніндегі басқарма",
            },
            {
                "ru": "Управление финансового обеспечения",
                "kk": "Қаржымен қамтамасыз ету басқармасы",
            },
            {
                "ru": "Управление документообеспечения",
                "kk": "Құжаттамалық қамтамасыз ету басқармасы",
            },
            {
                "ru": "Управление по борьбе с организованной преступностью",
                "kk": "Ұйымдасқан қылмыстарға қарсы күрес жөніндегі басқарма",
            },
            {
                "ru": "Управление административной полиции",
                "kk": "Әкімшілік полиция басқармасы",
            },
            {
                "ru": "Управление собственной безопасности",
                "kk": "Өзіндік қауіпсіздк басқармасы",
            }
        ]

        self.degrees: str = [
            {
                "ru": "генарал-лейтенант полиции",
                "kk": "полиция генерал-лейтенанты",
            },
            {
                "ru": "генерал-майора полиции",
                "kk": "полиция генерал-майоры",
            },
            {
                "ru": "полковник полиции",
                "kk": "полиция полковнигі",
            },
            {
                "ru": "подполковник полиции",
                "kk": "полиция подполковнигі",
            },
            {
                "ru": "майор полиции",
                "kk": "полиция майоры",
            },
            {
                "ru": "капитан полиции",
                "kk": "полиция капитаны",
            },
            {
                "ru": "старший лейтенант полиции",
                "kk": "полиция аға лейтенанты",
            },
            {
                "ru": "лейтенант полиции",
                "kk": "полиция лейтенанты",
            },
            {
                "ru": "старший сержант полиции",
                "kk": "полиция аға сержанты",
            },
            {
                "ru": "сержант полиции",
                "kk": "полиция сержанты",
            },
            {
                "ru": "младший лейтенант полиции",
                "kk": "полиция кіші сержанты",
            },
            {
                "ru": "рядовой полиции",
                "kk": "полиция қатардағы",
            }
        ]

    def generate_dicts(self):
        for d in self.departmens:
            department = Department.objects.filter(title=d['ru']).first()

            if not department:
                Department.objects.create(title=d['ru'], title_ru=d['ru'], title_kk=d['kk'])

        for m in self.managements:
            management = Management.objects.filter(title=m['ru']).first()

            if not management:
                Management.objects.create(title=m['ru'], title_ru=m['ru'], title_kk=m['kk'])

        for d in self.degrees:
            degree = Degree.objects.filter(title=d['ru']).first()

            if not degree:
                Degree.objects.create(title=d['ru'], title_ru=d['ru'], title_kk=d['kk'])

    def handle(self, *args: Any, **kwargs: Any) -> None:
        """Handles data filling."""
        start: datetime = datetime.now()

        self.generate_dicts()

        print(
            f'Generated in: {(datetime.now()-start).total_seconds()} seconds'
        )
